Repository: brokensmile2103/init-pulse-for-discord
Catalog: languages/init-pulse-for-discord-*.po
Languages: vi

source: Send notifications to Discord via webhooks. Minimal, fast, and ready for extension.
vi: Gửi thông báo tới Discord qua webhook. Nhẹ, nhanh và dễ mở rộng.

source: Settings
vi: Cài đặt

source: Discord Notifications
vi: Thông báo Discord

source: Enable Discord Notifications
vi: Bật thông báo Discord

source: Send notifications to Discord when content is published.
vi: Gửi thông báo đến Discord khi bài viết được đăng.

source: This page configures options only. Hook the actual sending into publish/update events.
vi: Trang này chỉ cấu hình cài đặt. Việc gửi thông báo sẽ được thực hiện khi có sự kiện đăng / cập nhật bài viết.

source: Events to Notify
vi: Sự kiện để thông báo

source: Notify On
vi: Thông báo khi

source: A new post is published (post type: post)
vi: Một bài viết mới được đăng (post type: post)

source: An existing post is updated (status remains publish)
vi: Một bài viết đang đăng được cập nhật

source: Webhook & Identity
vi: Webhook & Danh tính

source: Paste the full webhook URL from your Discord channel.
vi: Dán URL webhook đầy đủ lấy từ kênh Discord của bạn.

source: Default Username
vi: Tên mặc định

source: Shown as the sender name (e.g., "Init Bot").
vi: Hiển thị như tên người gửi (ví dụ: "Init Bot").

source: Avatar URL
vi: URL ảnh đại diện

source: Public image URL used as the webhook avatar (optional).
vi: URL ảnh đại diện cho webhook (không bắt buộc).

source: Content & Media
vi: Nội dung & Hình ảnh

source: Include Featured Image
vi: Đính kèm ảnh đại diện

source: Attach the featured image to the Discord embed (if available).
vi: Đính kèm ảnh đại diện của bài viết vào embed gửi Discord (nếu có).

source: Image Size
vi: Kích thước ảnh

source: Message Template
vi: Mẫu tin nhắn

source: New/Updated Post Template
vi: Mẫu thông báo bài viết mới / cập nhật

source: Available placeholders:
vi: Các placeholder có thể dùng:

source: Post title
vi: Tiêu đề bài viết

source: Post title linked to URL
vi: Tiêu đề bài viết (đính kèm liên kết)

source: Post URL
vi: URL bài viết

source: Post excerpt (trimmed)
vi: Tóm tắt bài viết

source: Your site name
vi: Tên website của bạn

source: Reliability & Safety
vi: Độ tin cậy & An toàn

source: Request Timeout (seconds)
vi: Thời gian chờ (giây)

source: Retry Attempts
vi: Số lần thử lại

source: Mention this role when notifying posts in this term.
vi: Nhắc role này khi gửi thông báo bài viết thuộc danh mục/thẻ này.

source: Enter Role ID for this term
vi: Nhập Role ID cho danh mục/thẻ này

source: Discord Role ID (all-posts role)
vi: Discord Role ID (role toàn bộ bài viết)

source: Enter Role ID for all-posts notifications (optional)
vi: Nhập Role ID cho thông báo toàn bộ bài viết (tùy chọn)

source: Optional broader role subscribed to all updates.
vi: Tùy chọn — role nhận mọi thông báo.
